ken-feng/FIT_smartaccess/board/pin_mux.h
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDs(void);

//=====================================================================================================================
// [ Configuration Switch ] - 
//=====================================================================================================================
//Modify (Ken):NXP-V0001 NO.1 -20240304
#if defined __HW_BLE_UWB_FOB_H
      /*! @name PORTB3 (number xx), SW3
        @{ */
      #define BOARD_INITBUTTONS_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_INITBUTTONS_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_INITBUTTONS_SW3_PIN  0U     /*!<@brief PORTB pin index: 3 */
                                               /* @} */
#elif defined __HW_BLE_UWB_G2_H
      /*! @name PORTB3 (number xx), SW3
        @{ */
      #define BOARD_INITBUTTONS_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_INITBUTTONS_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_INITBUTTONS_SW3_PIN  3U     /*!<@brief PORTB pin index: 3 */
                                               /* @} */
#elif defined __HW_BLE_UWB_EVT1_H
      /*! @name PORTB3 (number xx), SW1
        @{ */
      #define BOARD_INITBUTTONS_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_INITBUTTONS_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_INITBUTTONS_SW3_PIN  0U     /*!<@brief PORTB pin index: 3 */
                                               /* @} */
      /*! @name PORTB3 (number xx), SW2
        @{ */
      #define BOARD_INITBUTTONS_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_INITBUTTONS_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_INITBUTTONS_SW3_PIN  1U     /*!<@brief PORTB pin index: 3 */
                                               /* @} */
      /*! @name PORTB3 (number xx), SW3
        @{ */
      #define BOARD_INITBUTTONS_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_INITBUTTONS_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_INITBUTTONS_SW3_PIN  2U     /*!<@brief PORTB pin index: 3 */
                                               /* @} */

#elif defined __HW_VENUS_EVT1_H


#else
/*! @name PORTB18 (number 23), SW2
  @{ */
#define BOARD_INITBUTTONS_SW2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITBUTTONS_SW2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITBUTTONS_SW2_PIN 18U    /*!<@brief PORTB pin index: 18 */
                                         /* @} */

/*! @name PORTC2 (number 38), SW3
  @{ */
#define BOARD_INITBUTTONS_SW3_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITBUTTONS_SW3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITBUTTONS_SW3_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                         /* @} */
#endif

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitButtons
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitButtons(void);

//=====================================================================================================================
// [ Configuration SPI0 ] - 
//=====================================================================================================================
//Modify (Ken):NXP-V0001 NO.1 -20240304
#if defined __HW_BLE_UWB_G2_H || defined __HW_BLE_UWB_FOB_H || defined __HW_BLE_UWB_EVT1_H || defined __HW_VENUS_EVT1_H

#else
/*! @name PORTC16 (number 45), SPI0_CLK */
#define BOARD_SPI0_CLK_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SPI0_CLK_PIN  16U    /*!<@brief PORTC pin index: 16 */

/*! @name PORTC17 (number 46), SPI0_MISO */
#define BOARD_SPI0_MISO_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SPI0_MISO_PIN 17U     /*!<@brief PORTC pin index: 17 */

/*! @name PORTC18 (number 47), SPI0_MOSI */
#define BOARD_SPI0_MOSI_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SPI0_MOSI_PIN 18U     /*!<@brief PORTC pin index: 18 */

/*! @name PORTC18 (number 47), SPI0_MOSI */
#define BOARD_SPI0_CS_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SPI0_CS_PIN  19U     /*!<@brief PORTC pin index: 18 */
#endif
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI0Pin
 * Description   : Init SPI0 pins, CS pin will be manually controlled for SPI split mode
 *
 * END ****************************************************************************************************************/      
void BOARD_InitSPI0Pins(void);

//=====================================================================================================================
// [ Configuration SPI1 ] - 
//=====================================================================================================================
//Modify (Ken):NXP-V0001 NO.1 -20240304
/*! @name PORTA16 (number 4), SPI1_SOUT */
#define BOARD_SPI1_MISO_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SPI1_MISO_PIN  16U    /*!<@brief PORTA pin index: 16 */

/*! @name PORTA17 (number 5), SPI1_SIN */
#define BOARD_SPI1_MOSI_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SPI1_MOSI_PIN 17U     /*!<@brief PORTA pin index: 17 */

/*! @name PORTA18 (number 6), SPI1_CLK */
#define BOARD_SPI1_CLK_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SPI1_CLK_PIN 18U     /*!<@brief PORTA pin index: 18 */

