ken-feng/FIT_smartaccess/board/pin_mux.h
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI1Pin
 * Description   : Init SPI0 pins, CS pin will be manually controlled for SPI split mode
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI1Pins(void);

//=====================================================================================================================
// [ Configuration CAN0 ] - 
//=====================================================================================================================
//Modify (Ken):NXP-V0001 NO.1 -20240304
#if defined __HW_BLE_UWB_FOB_H

#elif defined __HW_BLE_UWB_G2_H || defined __HW_BLE_UWB_EVT1_H || defined __HW_VENUS_EVT1_H
    #define BOARD_INITFLEXCAN_CAN0_TX_PORT PORTC
    #define BOARD_INITFLEXCAN_CAN0_TX_PIN 3U

    #define BOARD_INITFLEXCAN_CAN0_RX_PORT PORTC
    #define BOARD_INITFLEXCAN_CAN0_RX_PIN 4U

	#define BOARD_INITFLEXCAN_CAN0_STB_GPIO GPIOC
	#define BOARD_INITFLEXCAN_CAN0_STB_PORT PORTC
	#define BOARD_INITFLEXCAN_CAN0_STB_PIN 2U

	/* Symbols to be used with PORT driver */
	#define BOARD_INITPINS_CAN_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
	#define BOARD_INITPINS_CAN_RX_PIN 4U                   /*!<@brief PORT pin number */
	#define BOARD_INITPINS_CAN_RX_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
														   /* @} */

	/*! @name PORTC3 (number 39), J1[4]/U19[1]/U20[4]/D3/CAN_TX
	  @{ */

	/* Symbols to be used with PORT driver */
	#define BOARD_INITPINS_CAN_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
	#define BOARD_INITPINS_CAN_TX_PIN 3U                   /*!<@brief PORT pin number */
	#define BOARD_INITPINS_CAN_TX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
														   /* @} */
#else
//    #define BOARD_INITFLEXCAN_CAN0_TX_PORT PORTC
//    #define BOARD_INITFLEXCAN_CAN0_TX_PIN 3U
//
//    #define BOARD_INITFLEXCAN_CAN0_RX_PORT PORTC
//    #define BOARD_INITFLEXCAN_CAN0_RX_PIN 4U
#endif

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexcan
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexcan(void);

//=====================================================================================================================
// [ Configuration UWB ] - 
//=====================================================================================================================
//Modify (Ken):NXP-V0001 NO.3 -20240319
#if defined __HW_BLE_UWB_G2_H || defined __HW_BLE_UWB_FOB_H || defined __HW_BLE_UWB_EVT1_H || defined __HW_VENUS_EVT1_H
      /*! @name PORTA19 (number 7), UWB_CS output*/
      #define BOARD_UWB_CS_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
      #define BOARD_UWB_CS_PORT PORTA /*!<@brief PORT device name: PORTA */
      #define BOARD_UWB_CS_PIN  19U     /*!<@brief PORTA pin index: 19 */

      #if defined __HW_BLE_UWB_FOB_H
      /*! @name PORTC4 (number xx), UWB_RDY input*/
      #define BOARD_UWB_RDY_GPIO GPIOC /*!<@brief GPIO device name: GPIOB */
      #define BOARD_UWB_RDY_PORT PORTC /*!<@brief PORT device name: PORTB */
      #define BOARD_UWB_RDY_PIN  4U     /*!<@brief PORTC pin index: 0 */
      #else
      /*! @name PORTB0 (number xx), UWB_RDY input*/
      #define BOARD_UWB_RDY_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_UWB_RDY_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_UWB_RDY_PIN  0U     /*!<@brief PORTC pin index: 0 */
      #endif

      /*! @name PORTC1 (number xx), UWB_RST output */
      #define BOARD_UWB_RST_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
      #define BOARD_UWB_RST_PORT PORTC /*!<@brief PORT device name: PORTC */
      #define BOARD_UWB_RST_PIN  1U     /*!<@brief PORTC pin index: 1 */

      /*! @name PORTB18 (number xx), UWB_INT input */
      #define BOARD_UWB_INT_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
      #define BOARD_UWB_INt_PORT PORTB /*!<@brief PORT device name: PORTB */
      #define BOARD_UWB_INT_PIN  18U     /*!<@brief PORTC pin index: 18 */
#else
      /*! @name PORTA19 (number 7), UWB_CS output*/
      #define BOARD_UWB_CS_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
      #define BOARD_UWB_CS_PORT PORTA /*!<@brief PORT device name: PORTA */
      #define BOARD_UWB_CS_PIN 19U     /*!<@brief PORTA pin index: 19 */

      /*! @name PORTC5 (number 41), UWB_RDY input*/
      #define BOARD_UWB_RDY_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
      #define BOARD_UWB_RDY_PORT PORTC /*!<@brief PORT device name: PORTC */
      #define BOARD_UWB_RDY_PIN 5U     /*!<@brief PORTC pin index: 5 */

      /*! @name PORTC19 (number 48), UWB_RST output */
      #define BOARD_UWB_RST_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
      #define BOARD_UWB_RST_PORT PORTC /*!<@brief PORT device name: PORTC */
      #define BOARD_UWB_RST_PIN 19U     /*!<@brief PORTC pin index: 19 */

      /*! @name PORTC6 (number 42), UWB_INT input */
      #define BOARD_UWB_INT_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
      #define BOARD_UWB_INt_PORT PORTC /*!<@brief PORT device name: PORTC */
      #define BOARD_UWB_INT_PIN 6U     /*!<@brief PORTC pin index: 6 */
#endif

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRanger4Pins
 * Description   : Init UWB connected Pins
 *
 * END ****************************************************************************************************************/
//Modify (Ken):NXP-V0001 NO.3 -20240319
void BOARD_InitRanger4Pins(void);

//=====================================================================================================================
// [ Configuration Security Chip ] - 
//=====================================================================================================================
#define BOARD_SECURITY_EN_GPIO  GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_SECURITY_EN_PORT  PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SECURITY_EN_PIN   5U     /*!<@brief PORTC pin index: 5 */


#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
